In [2]:
import pandas as pd
import numpy as np

df = pd.read_csv('train.csv')

In [3]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [4]:
dicionario = {
    'COLUNA_A': [1, 2, 3, 4, 5],
    'COLUNA_B': ['a', 'b', 'c', 'd', 'e'],
    'COLUNA_C': [100, 200, 300, 400, 500]
}

In [5]:
df = pd.DataFrame(dicionario)
df

   COLUNA_A COLUNA_B  COLUNA_C
0         1        a       100
1         2        b       200
2         3        c       300
3         4        d       400
4         5        e       500

In [6]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario)
df

             nome  qtd_estoque
0         Celular           15
1          Tablet            8
2        Notebook           20
3  Fone de Ouvido            5
4      Smartwatch           12

In [7]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'])
df

   altura  peso
0    1.69  87.0
1    1.59  56.5
2    1.69  90.3
3    1.74  78.6

In [8]:
produtos = pd.Series(['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'])
quantidade_estoque = pd.Series([15, 8, 20, 5, 12])

dicionario = {
    'nome': ['Celular', 'Tablet', 'Notebook', 'Fone de Ouvido', 'Smartwatch'],
    'qtd_estoque': [15, 8, 20, 5, 12]
}

df = pd.DataFrame(dicionario, index=[214314, 431431, 532453, 542234, 431413])
df

                  nome  qtd_estoque
214314         Celular           15
431431          Tablet            8
532453        Notebook           20
542234  Fone de Ouvido            5
431413      Smartwatch           12

In [9]:
df.shape

(5, 2)

In [10]:
df.index

Index([214314, 431431, 532453, 542234, 431413], dtype='int64')

In [11]:
df.to_csv("produtos.csv", index=False)

In [12]:
dados = [
  [1.69, 87.0],
  [1.59, 56.5],
  [1.69, 90.3],
  [1.74, 78.6]
]
df = pd.DataFrame(dados, columns=['altura', 'peso'], index = ['a', 'b', 'c', 'd'])
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [13]:
df['peso']

a    87.0
b    56.5
c    90.3
d    78.6
Name: peso, dtype: float64

In [14]:
df[['peso', 'altura']]

   peso  altura
a  87.0    1.69
b  56.5    1.59
c  90.3    1.69
d  78.6    1.74

In [15]:
df.iloc[1]

altura     1.59
peso      56.50
Name: b, dtype: float64

In [16]:
df.iloc[0]

altura     1.69
peso      87.00
Name: a, dtype: float64

In [17]:
df.loc['b']

altura     1.59
peso      56.50
Name: b, dtype: float64

In [18]:
df['peso'][1]

C:\Users\Drac3\AppData\Local\Temp\ipykernel_3996\2551684995.py:1: FutureWarning: Series.__getitem__ treating keys as positions is deprecated. In a future version, integer keys will always be treated as labels (consistent with DataFrame behavior). To access a value by position, use `ser.iloc[pos]`
  df['peso'][1]

56.5

In [19]:
df['peso'].loc['b']

56.5

In [20]:
df.iloc[1, 0]

1.59

In [21]:
df.loc['b', 'altura']

1.59

In [22]:
df

   altura  peso
a    1.69  87.0
b    1.59  56.5
c    1.69  90.3
d    1.74  78.6

In [23]:
df.iat[1, 0] # No caso do iat, acessamos [linha, coluna], usando a posição

1.59

In [29]:
df.at[1, 'altura'] # No caso do at, acessamos [linha, coluna], usando os rótulos

KeyError: 1

In [26]:
df.at[1] # isto já não conseguiremos fazer

TypeError: DataFrame._get_value() missing 1 required positional argument: 'col'

In [30]:
dados = [
  [1.69, 87.0, 'Fulano'],
  [1.59, 56.5, 'Sicrana'],
  [1.69, 90.3, 'Beltrana'],
  [1.74, 78.6, 'João']
]
df = pd.DataFrame(dados, columns=['altura', 'peso', 'nomes'])
df

   altura  peso     nomes
0    1.69  87.0    Fulano
1    1.59  56.5   Sicrana
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [31]:
df.loc[1:3, ['peso', 'nomes']]

   peso     nomes
1  56.5   Sicrana
2  90.3  Beltrana
3  78.6      João

In [32]:
df[['nomes', 'altura']]

      nomes  altura
0    Fulano    1.69
1   Sicrana    1.59
2  Beltrana    1.69
3      João    1.74

In [33]:
df

   altura  peso     nomes
0    1.69  87.0    Fulano
1    1.59  56.5   Sicrana
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [34]:
df[df['peso'] > 78.0]

   altura  peso     nomes
0    1.69  87.0    Fulano
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [35]:
df

   altura  peso     nomes
0    1.69  87.0    Fulano
1    1.59  56.5   Sicrana
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [36]:
df[(df['peso'] > 78.0) & (df['altura'] > 1.70)]

   altura  peso nomes
3    1.74  78.6  João

In [37]:
df.query('peso > 78.0 and altura > 1.70')

   altura  peso nomes
3    1.74  78.6  João

In [38]:
df

   altura  peso     nomes
0    1.69  87.0    Fulano
1    1.59  56.5   Sicrana
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [39]:
df.at[1, 'altura'] = 1.50
df

   altura  peso     nomes
0    1.69  87.0    Fulano
1    1.50  56.5   Sicrana
2    1.69  90.3  Beltrana
3    1.74  78.6      João

In [40]:
df.loc[:2, 'peso'] = [77.2, 64.2, 85.0]
df

   altura  peso     nomes
0    1.69  77.2    Fulano
1    1.50  64.2   Sicrana
2    1.69  85.0  Beltrana
3    1.74  78.6      João

In [41]:
df['sobrenomes'] = ['Marques', 'Magalhães', 'Silva', 'Terra']
df

   altura  peso     nomes sobrenomes
0    1.69  77.2    Fulano    Marques
1    1.50  64.2   Sicrana  Magalhães
2    1.69  85.0  Beltrana      Silva
3    1.74  78.6      João      Terra

In [42]:
df['altura'] > 1.70

0    False
1    False
2    False
3     True
Name: altura, dtype: bool

In [44]:
df['altura > 1,70'] = df['altura'] > 1.70
df

   altura  peso     nomes sobrenomes  altura > 1,70
0    1.69  77.2    Fulano    Marques          False
1    1.50  64.2   Sicrana  Magalhães          False
2    1.69  85.0  Beltrana      Silva          False
3    1.74  78.6      João      Terra           True

In [45]:
df['altura ** 2'] = df['altura'] ** 2
df

   altura  peso     nomes sobrenomes  altura > 1,70  altura ** 2
0    1.69  77.2    Fulano    Marques          False       2.8561
1    1.50  64.2   Sicrana  Magalhães          False       2.2500
2    1.69  85.0  Beltrana      Silva          False       2.8561
3    1.74  78.6      João      Terra           True       3.0276

In [46]:
df.to_numpy()

array([[1.69, 77.2, 'Fulano', 'Marques', False, 2.8560999999999996],
       [1.5, 64.2, 'Sicrana', 'Magalhães', False, 2.25],
       [1.69, 85.0, 'Beltrana', 'Silva', False, 2.8560999999999996],
       [1.74, 78.6, 'João', 'Terra', True, 3.0276]], dtype=object)

In [47]:
df.values

array([[1.69, 77.2, 'Fulano', 'Marques', False, 2.8560999999999996],
       [1.5, 64.2, 'Sicrana', 'Magalhães', False, 2.25],
       [1.69, 85.0, 'Beltrana', 'Silva', False, 2.8560999999999996],
       [1.74, 78.6, 'João', 'Terra', True, 3.0276]], dtype=object)

In [48]:
df1 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [2, 4, 6, 8]})
df2 = pd.DataFrame({'x': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})
df3 = pd.DataFrame({'a': [1, 2, 3, 4], 'y': [3, 6, 9, 12]})

print(df1)
print(df2)
print(df3)

   x  y
0  1  2
1  2  4
2  3  6
3  4  8
   x   y
0  1   3
1  2   6
2  3   9
3  4  12
   a   y
0  1   3
1  2   6
2  3   9
3  4  12

In [49]:
resultado1 = df1 + df2
print(resultado1)

   x   y
0  2   5
1  4  10
2  6  15
3  8  20

In [50]:
resultado2 = df1 + df3
print(resultado2)

    a   x   y
0 NaN NaN   5
1 NaN NaN  10
2 NaN NaN  15
3 NaN NaN  20

In [51]:
resultado3 = df1.add(df3, fill_value=0)
print(resultado3)

     a    x   y
0  1.0  1.0   5
1  2.0  2.0  10
2  3.0  3.0  15
3  4.0  4.0  20

In [52]:
data = {'altura': [1.69, 1.50, 1.69, 1.74],
        'peso': [77.2, 64.2, 85.0, 78.6],
        'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes
b    1.69  77.2    Fulano
a    1.50  64.2   Sicrana
c    1.69  85.0  Beltrana
f    1.74  78.6      João

In [53]:
df.sort_index()

   altura  peso     nomes
a    1.50  64.2   Sicrana
b    1.69  77.2    Fulano
c    1.69  85.0  Beltrana
f    1.74  78.6      João

In [54]:
df.sort_values('peso')

   altura  peso     nomes
a    1.50  64.2   Sicrana
b    1.69  77.2    Fulano
f    1.74  78.6      João
c    1.69  85.0  Beltrana

In [55]:
df.sort_values('peso', ascending=False)

   altura  peso     nomes
c    1.69  85.0  Beltrana
f    1.74  78.6      João
b    1.69  77.2    Fulano
a    1.50  64.2   Sicrana

In [56]:
df[['nomes', 'peso', 'altura']]

      nomes  peso  altura
b    Fulano  77.2    1.69
a   Sicrana  64.2    1.50
c  Beltrana  85.0    1.69
f      João  78.6    1.74

In [57]:
df.columns

Index(['altura', 'peso', 'nomes'], dtype='object')

In [58]:
df = df.drop(columns=['nomes'])
df

   altura  peso
b    1.69  77.2
a    1.50  64.2
c    1.69  85.0
f    1.74  78.6

In [59]:
df = df.rename(columns={'altura': 'ALTURA', 'peso': 'PESO'})
df

   ALTURA  PESO
b    1.69  77.2
a    1.50  64.2
c    1.69  85.0
f    1.74  78.6

In [60]:
df['PESO'].astype(np.int64)

b    77
a    64
c    85
f    78
Name: PESO, dtype: int64

In [61]:
data = {
    'altura': [1.69, 1.50, 1.69, 1.74],
    'peso': [77.2, 64.2, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João'],
    'idade': [30, 25, 35, 40],  # Adicionando a coluna 'idade'
    'sexo': ['M', 'F', 'F', 'M']  # Adicionando a coluna 'sexo'
}

index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes  idade sexo
b    1.69  77.2    Fulano     30    M
a    1.50  64.2   Sicrana     25    F
c    1.69  85.0  Beltrana     35    F
f    1.74  78.6      João     40    M

In [62]:
colunas_desejadas = ['nomes', 'idade', 'altura', 'peso']
df = df[colunas_desejadas]
df

      nomes  idade  altura  peso
b    Fulano     30    1.69  77.2
a   Sicrana     25    1.50  64.2
c  Beltrana     35    1.69  85.0
f      João     40    1.74  78.6

In [63]:
df.reset_index()

  index     nomes  idade  altura  peso
0     b    Fulano     30    1.69  77.2
1     a   Sicrana     25    1.50  64.2
2     c  Beltrana     35    1.69  85.0
3     f      João     40    1.74  78.6

In [64]:
df.set_index('nomes')

          idade  altura  peso
nomes
Fulano       30    1.69  77.2
Sicrana      25    1.50  64.2
Beltrana     35    1.69  85.0
João         40    1.74  78.6

In [65]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}

df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [66]:
df['imc'] = df.apply(lambda row: row['peso'] / (row['altura'] ** 2), axis=1)
df

   altura  peso        imc
0    1.69  77.2  27.029866
1    1.50  68.0  30.222222
2    1.58  65.0  26.037494
3    1.69  85.0  29.760863
4    1.74  78.6  25.961157
5    1.73  69.2  23.121387

In [67]:
# Definir a função para calcular o IMC
def calcular_imc(row):
    return row['peso'] / (row['altura'] ** 2)

# Aplicar a função usando apply
df['imc'] = df.apply(calcular_imc, axis=1)
df

   altura  peso        imc
0    1.69  77.2  27.029866
1    1.50  68.0  30.222222
2    1.58  65.0  26.037494
3    1.69  85.0  29.760863
4    1.74  78.6  25.961157
5    1.73  69.2  23.121387

In [68]:
data = {
    'altura': [1.69, 1.50, 1.69, np.nan],
    'peso': [77.2, np.nan, 85.0, 78.6],
    'nomes': ['Fulano', 'Sicrana', 'Beltrana', 'João']
}
index = ['b', 'a', 'c', 'f']

df = pd.DataFrame(data, index=index)
df

   altura  peso     nomes
b    1.69  77.2    Fulano
a    1.50   NaN   Sicrana
c    1.69  85.0  Beltrana
f     NaN  78.6      João

In [69]:
df.isnull().sum()

altura    1
peso      1
nomes     0
dtype: int64

In [70]:
df.dropna()

   altura  peso     nomes
b    1.69  77.2    Fulano
c    1.69  85.0  Beltrana

In [71]:
df

   altura  peso     nomes
b    1.69  77.2    Fulano
a    1.50   NaN   Sicrana
c    1.69  85.0  Beltrana
f     NaN  78.6      João

In [74]:
df = df.fillna(-1)

In [75]:
df.replace(-1, 60)

   altura  peso     nomes
b    1.69  77.2    Fulano
a    1.50  60.0   Sicrana
c    1.69  85.0  Beltrana
f   60.00  78.6      João

In [76]:
data = {
    'a': [1, 1, 2, 2],
    'b': [0, 0, 1, 2]
}

df_dup = pd.DataFrame(data)
df_dup

   a  b
0  1  0
1  1  0
2  2  1
3  2  2

In [77]:
df_dup.drop_duplicates()

   a  b
0  1  0
2  2  1
3  2  2

In [78]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2]
}
df = pd.DataFrame(data)
df

   altura  peso
0    1.69  77.2
1    1.50  68.0
2    1.58  65.0
3    1.69  85.0
4    1.74  78.6
5    1.73  69.2

In [79]:
df.mean()

altura     1.655000
peso      73.833333
dtype: float64

In [80]:
df.min()

altura     1.5
peso      65.0
dtype: float64

In [81]:
df.max()

altura     1.74
peso      85.00
dtype: float64

In [82]:
df.describe()

         altura       peso
count  6.000000   6.000000
mean   1.655000  73.833333
std    0.094816   7.645565
min    1.500000  65.000000
25%    1.607500  68.300000
50%    1.690000  73.200000
75%    1.720000  78.250000
max    1.740000  85.000000

In [83]:
data = {
    'categoria': ['eletrônicos', 'eletrônicos', 'vestuário', 'vestuário', 'acessórios'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}
df_vendas = pd.DataFrame(data)
df_vendas

     categoria  valor_venda
0  eletrônicos         1000
1  eletrônicos         1500
2    vestuário          800
3    vestuário         1200
4   acessórios          500

In [84]:
df_vendas.groupby('categoria').sum()

             valor_venda
categoria
acessórios           500
eletrônicos         2500
vestuário           2000

In [85]:
df_vendas.groupby('categoria').mean()

             valor_venda
categoria
acessórios         500.0
eletrônicos       1250.0
vestuário         1000.0

In [86]:
data = {
    'categoria': ['eletrônicos', 'eletrônicos', 'vestuário', 'vestuário', 'acessórios'],
    'mes': ['jan', 'jan', 'fev', 'fev', 'jan'],
    'valor_venda': [1000, 1500, 800, 1200, 500]
}

df_vendas = pd.DataFrame(data)
df_vendas

     categoria  mes  valor_venda
0  eletrônicos  jan         1000
1  eletrônicos  jan         1500
2    vestuário  fev          800
3    vestuário  fev         1200
4   acessórios  jan          500

In [87]:
df_vendas.groupby(['categoria', 'mes']).sum()

                 valor_venda
categoria   mes
acessórios  jan          500
eletrônicos jan         2500
vestuário   fev         2000

In [88]:
df_vendas.groupby(['categoria', 'mes']).median()

                 valor_venda
categoria   mes
acessórios  jan        500.0
eletrônicos jan       1250.0
vestuário   fev       1000.0

In [89]:
df_vendas.groupby(['categoria', 'mes']).max()

                 valor_venda
categoria   mes
acessórios  jan          500
eletrônicos jan         1500
vestuário   fev         1200

In [90]:
data = {
    'altura': [1.69, 1.50, 1.58, 1.69, 1.74, 1.73],
    'peso': [77.2, 68.0, 65.0, 85.0, 78.6, 69.2],
    'genero': [0.0, 0.0, 0.0, 1.0, 1.0, 1.0],
    'carioca': [1, 0, 1, 0, 1, 0]
}

df = pd.DataFrame(data)
df

   altura  peso  genero  carioca
0    1.69  77.2     0.0        1
1    1.50  68.0     0.0        0
2    1.58  65.0     0.0        1
3    1.69  85.0     1.0        0
4    1.74  78.6     1.0        1
5    1.73  69.2     1.0        0

In [91]:
df.pivot_table(index='genero', columns='carioca', values='peso', aggfunc=np.max)

C:\Users\Drac3\AppData\Local\Temp\ipykernel_3996\3585861850.py:1: FutureWarning: The provided callable <function max at 0x00000275BD96F240> is currently using DataFrameGroupBy.max. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "max" instead.
  df.pivot_table(index='genero', columns='carioca', values='peso', aggfunc=np.max)

carioca     0     1
genero
0.0      68.0  77.2
1.0      85.0  78.6

In [92]:
df.pivot_table(index='carioca', columns='genero', values='peso', aggfunc=np.sum)

C:\Users\Drac3\AppData\Local\Temp\ipykernel_3996\622045837.py:1: FutureWarning: The provided callable <function sum at 0x00000275BD96EB60> is currently using DataFrameGroupBy.sum. In a future version of pandas, the provided callable will be used directly. To keep current behavior pass the string "sum" instead.
  df.pivot_table(index='carioca', columns='genero', values='peso', aggfunc=np.sum)

genero     0.0    1.0
carioca
0         68.0  154.2
1        142.2   78.6